-- -----------------------------------------------------------------------------
-- -----------------------------------------------------------------------------
--  Hammer of Justas
--
-- Copyright (C) 2010-2020
-- By Jonathan E. Wright
--
local addonName, HoJ = ...

HoJ.HOJ_SHOW = "Показать ";
HoJ._text_ruRU = {
    ["PALADIN"] = "Паладин",
    ["PALADINS"] = "паладины",
    ["WARRIOR"] = "Воин",
    ["WARRIORS"] = "воины",
    ["Retribution"] = "Воздояние",
    ["Protection"] = "Защита",
    ["Loaded Paladin"] = "Загружена модификация для Паладинов.",
    ["Holy"] = "Свет",
    ["Arms"] = "Оружие",
    ["Fury"] = "Неистовство",
    ["Loaded Warrior"] = "Загружена модификация для Воинов.",
    ["Paladin Settings"] = "Настройки Паладина",
    ["Warrior Settings"] = "Настройки Воина",
    ["Global Frame Toggles"] = "Глобальные Переключатели Рамок",
    ["Frame Toggles"] = "Переключатели Рамок",
    ["Skill Toggles"] = "Переключатели Способностей",
    ["Frame Alpha"] = "Прозрачность Рамки",
    ["CLASS_NOT_SUPPORTED"] = "Аддон The Hammer of Justas предназначен для паладинов и воинов. Аддон отключен.",
    ["SPEC_UNKNOWN"] = "Неизвестные или неподтвержденные специализации!",
    ["SPEC_NOT_SUPPORTED"] = " специализация не поддерживается. Аддон будет отключен в этой специализации.",
    ["SPEC_CHANGED"] = "Специализация изменилась на ",
    ["LEVEL_CHANGED"] = "Уровень изменился с ",
    ["SPECIALIZATION_IS"] = "Специализация есть ",
    ["VERSION"] = " версия ", -- первая часть "Hammer of Justas версия <n> загружена для <classname>"
    ["LOADED_FOR"] = " загружена для ", -- вторая часть "Hammer of Justas версия <n> загружена для <classname>"
    ["GREETING_FIRST"] = "Добро пожаловать, ", -- первая часть "Добро пожаловать, <name>. Пусть свет благоволит твоему молоту."
    ["GREETING_SECOND"] = ". Пусть свет благоволит твоему молоту.", -- вторая часть "Добро пожаловать, <name>. Пусть свет благоволит твоему молоту."
}

HoJ._text = HoJ._text_ruRU
